import { Developer } from "../../types/types";

export const nadyavalin: Developer = {
  introText: `\u22d9 Одной из задач Надежды, как тимлида, было распределение задач на GitHub project board, 
что не составило для нее труда, так как на основной работе, как оказалось, она занимается тем же самым.
Также Надежда занималась дизайном, версткой, стилями и контентом, подключением и настройкой модулей непосредственно в eCommerce Tools
(настройка цен, скидок, налогов, каналов поставки и т.д.). Надежда настроила роутинг, сделала три слайдера, верстку главной страницы, страницы "О нас",
карточек для Каталога и для Корзины, верстку самой страницы Корзины, а также настроила пагинацию в Каталоге.`,
  bioText: `Я ведущий специалист по аудиту и мониторингу процессов и проектов.
  В мои обязанности входит мониторить проекты, следить за тем, как менеджеры проектов применяют разные методологии.
  Меня называют scrum-мастером, но я просто помогаю менеджерам правильно вести свои проекты в Bitrix.
  Все полезную информацию я отражаю в Базе знаний Bitrix.
  На своей работе я всего этого добилась благодаря приобретенным навыкам в RSSchool.
  Теперь хочу стать полноценным front-end разработчиком и применить свои навыки
  (совместно с back-end разработчиками) в разработке ПО на своей текущей работе.`,
  githubLink: "https://github.com/nadyavalin",
  githubName: "nadyavalin",
  imageSrc: "../../public/developers-img/nadyavalin.jpg",
  name: "Надежда Ткачук",
  position: "Front-end developer",
};

export const raenlin: Developer = {
  introText: `\u22d9 Задача Дарьи была одной из самых сложных - соединить backend с frontend. 
Дарья виртуозно овладела SDK, работала с подключением функционала приложения - над потоками авторизации, токеном доступа
и формированием анонимной и авторизованной сессий. Дарья сверстала и реализовала функционал для страниц Логина, Каталога, Корзины,
добавила категории и поиск в Каталог. Дарья каждый спринт приводила нас к максимальному баллу за кросс-чек! 
Проверяющим практически не к чему было придраться!`,
  bioText: `Дипломированный звукорежиссер и недипломированный SMM специалист.
Много работала с людьми, поэтому имею хорошие софт-скилы и навыки взаимодействия в команде.
Люблю учиться, программировать и креативить. Еще со школы интересовалась HTML, писала простенькие интерфейсы, что,
спустя много лет, привело меня во фронтенд разработку.`,
  githubLink: "https://github.com/raenlin",
  githubName: "raenlin",
  imageSrc: "../../public/developers-img/raenlin.jpg",
  name: "Дарья Пчелинцева",
  position: "Front-end developer",
};

export const katika: Developer = {
  introText: `\u22d9 Екатерина также неподражаемо овладела SDK. Ее задача была также сложна - соединить backend с frontend. 
Екатерина полностью сверстала и подключила функциональную часть страницы регистрации, сделала валидацию форм,
полностью вместе с версткой взяла на себя страницу Профиля пользователя, сделала все фильтры и сортировку для Каталога, и также неустанно 
работала над подключением функционала Корзины! Без Екатерины наша команда не смогла бы просто существовать!`,
  bioText: `Я окончила БГУ по специальности «биотехнология» и много лет работала в фармацевтической сфере.
Интерес к технологиям, красивым и удобным интерфейсам, а также желание учиться привели меня в мир программирования.
Обучение в школе позволило мне приобрести необходимые навыки, умение работать самостоятельно и в команде,
выполнять разработки в соответствии с техническим заданием.
Моя мечта — работать над проектом, связанным с биотехнологиями, наукой, образованием или медициной.`,
  githubLink: "https://github.com/ifbfirst",
  githubName: "katika",
  imageSrc: "../../public/developers-img/ifbfirst.jpg",
  name: "Екатерина Машко",
  position: "Front-end developer",
};

export const introduction = `три молодые активные девушки, которые всегда на связи и всегда на коде.
Каждый из нас привнес в проект огромный вклад! Трудились и днем и ночью. Если на первом спринте мы выбирали, кто чем будет заниматься,
знакомились, то дальше стало понятно, кто и в чем силен и работы распределялись практически мгновенно.
Почти непрерывная переписка в Telegram заменила ежедневные созвоны (сами созвоны проводились каждые 3-4 дня).
На протяжении всего финального таска в команде царило полное взаимопонимание!`;
