export const introduction1p = `три молодые активные девушки, которые всегда на связи и всегда на коде.
Каждый из нас привнес в проект огромный вклад! Трудились и днем и ночью. Если на первом спринте мы выбирали, кто чем будет заниматься,
знакомились, то дальше стало понятно, кто и в чем силен и работы распределялись практически мгновенно.
Почти непрерывная переписка в Telegram заменила ежедневные созвоны (сами созвоны проводились каждые 3-4 дня).
На протяжении всего финального таска в команде царило полное взаимопонимание!`;

export const introduction2p = `\u22d9 Задача Дарьи была самая сложная - соединить backend с frontend. 
Дарья виртуозно овладела SDK и подключила больше половины функционала приложения, работала над потоками авторизации и токеном доступа.
Дарья сверстала и реализовала функционал для страниц Логина и Каталога, добавила категории и поиск в Каталог.
Работа с подключением функционала Корзины также была в основном на Дарье. Дарья каждый спринт приводила нас к максимальному баллу за кросс-чек! 
Проверяющим практически не к чему было придраться!`;

export const introduction3p = `\u22d9 Одной из задач Надежды, как тимлида, было распределением задач на GitHub project board, 
что не составило для нее труда, так как на основной работе, как оказалось, она занимается тем же самым.
Также Надежда занималась дизайном, версткой, стилями и контентом, подключением и настройкой модулей непосредственно в eCommerce Tools
(настройка цен, скидок, налогов, каналов поставки и т.д.). Надежда настроила роутинг, сделала три слайдера, верстку главной страницы, 
страницы "О нас", карточек для Каталога и для Корзины и верстку самой страницы Корзины.`;

export const introduction4p = `\u22d9 Екатерина также неподражаемо овладела SDK. 
Ее задача была такой же сложной, как и у Дарьи - соединить backend с frontend. 
Екатерина полностью сверстала и подключила функциональную часть страницы регистрации, сделала валидацию форм,
полностью вместе с версткой взяла на себя страницу Профиля пользователя,
сделала все фильтры и сортировку для Каталога. И также неустанно работала с подключением функционала Корзины! 
Без Екатерины наша команда не смогла бы просто существовать!`;

export const nadyavalinBioText = `Я ведущий специалист по аудиту и мониторингу процессов и проектов.
  В мои обязанности входит мониторить проекты, следить за тем, как менеджеры проектов применяют разные методологии.
  Меня называют scrum-мастером, но я просто помогаю менеджерам правильно вести свои проекты в Bitrix.
  Все полезную информацию я отражаю в Базе знаний Bitrix.
  На своей работе я всего этого добилась благодаря приобретенным навыкам в RSSchool.
  Теперь хочу стать полноценным front-end разработчиком и применить свои навыки
  (совместно с back-end разработчиками) в разработке ПО на своей текущей работе.`;

export const raenlinBioText = `Дипломированный звукорежиссер и недипломированный SMM специалист.
Много работала с людьми, поэтому имею хорошие софт-скилы и навыки взаимодействия в команде.
Люблю учиться, программировать и креативить. Еще со школы интересовалась HTML, писала простенькие интерфейсы, что,
спустя много лет, привело меня во фронтенд разработку.`;

export const katikaBioText = `Я окончила БГУ по специальности «биотехнология» и много лет работала в фармацевтической сфере.
Интерес к технологиям, красивым и удобным интерфейсам, а также желание учиться привели меня в мир программирования.
Обучение в школе позволило мне приобрести необходимые навыки, умение работать самостоятельно и в команде,
выполнять разработки в соответствии с техническим заданием.
Моя мечта — работать над проектом, связанным с биотехнологиями, наукой, образованием или медициной.`;
